app/views/my_resumes/index.html.erb

SELECT "resumes".* FROM "resumes" WHERE "resumes"."user_id" = ?  [["user_id", 2]]
---
    <tr>
     <% current_user.resumes.each do |resume| %>