app/controllers/resumes_controller.rb

    def index
      @resumes = Resume.all.where(job_id: params[:job_id])
---
SELECT  "resumes".* FROM "resumes" WHERE "resumes"."job_id" = ? LIMIT ?  [["job_id", 13], ["LIMIT", 1]]

    def show
      @resume = Resume.find params[:id]
      @resume.update_attribute(:is_seen, true) unless @resume.is_seen
---
SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "resumes" SET "is_seen" = ?, "updated_at" = ? WHERE "resumes"."id" = ?  [["is_seen", "t"], ["updated_at", "2022-05-24 20:01:21.692612"], ["id", 2]]

    def create
      @job = Job.find(params[:job_id])
      @resume  = @job.resumes.build(resume_params)
      @resume.user_id = current_user.id

      if @resume.save
---
INSERT INTO "resumes" ("cover_letter", "job_id", "user_id", "created_at", "updated_at", "attachment") VALUES (?, ?, ?, ?, ?, ?)  [["cover_letter", "Job cover letter"], ["job_id", 14], ["user_id", 3], ["created_at", "2022-05-24 20:21:59.955046"], ["updated_at", "2022-05-24 20:21:59.955046"], ["attachment", "Document_5.pdf"]]

    def destroy
      @resume = Resume.find(params[:id])
      @resume.destroy
---
SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "resumes" WHERE "resumes"."id" = ?  [["id", 9]]